exit = "Спасибо, что пришли поболтать с нами и пройти викторину, будем ждать вас снова❤️"

text = """Похоже что ты заблудился и тебе нужна помощь😰\n
Не переживай, мы тебе поможем во всём разобраться.\n
Выбери куда ты хочешь переместиться⤵️
"""

text1 = """Привет😉\n\nМеня зовут Тимофей и я <a href="https://moscowzoo.ru/animals/khishchnye/manul/?sphrase_id=703611">Манул</a>🐱 
Я являюсь символом московского зоопарка с 1987 года.\n
<a href="https://moscowzoo.ru/animals/khishchnye/manul/?sphrase_id=703611">Московский зоопарк</a> — один из старейших зоопарков Европы с уникальной коллекцией животных и профессиональным сообществом. 
Предлагаю тебе пройти небольшую викторину, чтобы узнать
каким является твоё тотемное животное😃\n
Поверь, это не займет много времени😉
"""

text2 = """<b>О проекте</b>\n
«Возьми животное под опеку» («Клуб друзей») — это одна из программ, помогающих зоопарку заботиться о его обитателях. 
Программа позволяет с помощью пожертвования на любую сумму внести свой вклад в развитие зоопарка и сохранение биоразнообразия планеты.
Сейчас в Московском зоопарке живёт около 6 000 животных, представляющих примерно 1 100 биологических видов мировой фауны. 
Каждое животное уникально, и все требуют внимание и уход. Из ежедневного рациона питания животного как раз и рассчитывается стоимость его опеки.
Взять под опеку можно разных обитателей зоопарка, например, слона, льва, суриката или фламинго. 
Это возможность помочь любимому животному или даже реализовать детскую мечту подружиться с настоящим диким зверем. 
Почётный статус опекуна позволяет круглый год навещать подопечного, быть в курсе событий его жизни и самочувствия.
Поддержка опекунов помогает зоопарку улучшать условия для животных и повышать уровень их благополучия.
"""

text3 = """(Совет от разработчиков)\n
Давай не будем расстраивать Тимофея🥲 и пройдем викторину, \nиначе он спрячется от посетителей зоопарка,\n
и мы не сможем на него посмотреть☹️"""

text4 = """🐱Информация о программе опекунства <a href="https://moscowzoo.ru/my-zoo/become-a-guardian/">тут</a>
📧zoofriends@moscowzoo.ru
📞+7(962) 971 38 75 c 9:00 до 18:00
"""

text5 = """Да, ты Альпака😃\n
Редкое животное, численность которого в настоящее время несколько увеличивается, занесено в Красную книгу МСОП, I Приложение СИТЕС.
Викунья считалась священным животным в Андах с древнейших времен. 
Горцы верили, что она дана им богами для того, чтобы они могли выжить в голоде и холоде этих суровых мест. 
Во времена инков викунья была посвящена богу Солнца Инти. 
Инки называли её шерсть «золотым руном» или «руном богов», считали её целебной и запрещали убивать этих животных. 
Викуний ловили во время королевских охот, стригли и отпускали на волю, при этом численность животных в природе оставалась стабильной.
Из мягкой, красивой шерсти делали одежду для высоких вельмож. Испанцы же, прибыв в Южную Америку, 
начали отстреливать викуний в большом количестве. Это делалось в основном с целью получения самой дорогой и редкой в мире шерсти, 
хотя и мясо викуньи считалось деликатесом.
"""
text6 = """Да, ты Сова😃\n
Немного информации:
Белые совы имеют кругополярное распространение и весьма характерны для Арктики и Субарктики Евразии и Северной Америки. 
Они населяют океанические острова, побережья, материковые тундры и арктические пустыни. 
Это отчасти оседлые, но преимущественно кочующие птицы. 
Кочевки их нерегулярны и зависят от местных условий — снегового покрова, доступности и обилия корма и т. д.
Образ жизни и социальная организация
Белая сова ведет преимущественно дневной образ жизни, но все же предпочитает охотиться ранним утром или под вечер. 
В период полярного лета она может охотиться в любое время суток.
"""
text7 = """Да, ты Медведь😃\n
Немного о нём:
Хорошо известный зверь распространён почти по всему северному полушарию, символ мощи, силы, герой многих сказок и легенд.
Бурые медведи, в отличие от белых,  в большинстве своём осёдлы. 
Каждый индивидуальный участок, занятый одним зверем, может быть весьма обширен, и охватывать  площадь до нескольких сот кв. км. 
Границы участков обозначены слабо, а в сильно пересеченной местности практически отсутствуют. 
Участки самцов и самок перекрываются. В пределах участка есть места, где зверь обычно кормится, 
где находит временные убежища или залегает в берлогу.
"""
text8 = """Да, ты Манул😃\n
Немного о нём:
Активен, главным образом, в сумерки и ночью. 
Обычно его встречают в сумерках после захода солнца, или рано утром, летом нередко появляется и днём. 
Часть ночи проводит в логове.
Манул, подобно другим кошкам, предпочитает одиночество. 
Размеры индивидуального участка не выяснены, данные об этом лишь косвенные и отрывочные. 
Например, отмечается, что во время охоты манул может уходить от своего логова в камнях на 0,1–1 км, посещая ближайшие участки степи, а также поля, залежи и скалы. 
Во время сезона размножения за самкой в течке ходят несколько самцов, между которыми нередки ожесточённые драки.
"""
text9 = """Лови😁\n
Можешь сохранить картинку в фотоплёнку, отправить друзьям и опубликовать в любимой соц. сети😊
"""

#Вопросы и ответы для викторины
questions = [
    {'question1': '<b>1/9</b> Ты любишь поспать?', 'answer11': 'Нет, всегда встаю рано',
     'answer12': 'Ложусь поздно, люблю поспать', 'answer13': 'Встаю рано, в выходные люблю поспать',
     'answer14': 'Люблю спать больше всех','animal1': 'Альпака', 'animal2': 'Сова',
     'animal3': 'Манул', 'animal4': 'Медведь'},
    {'question2': '<b>2/9</b> Перед тобой шведский стол, что выберешь?', 'answer21': 'Поем салатик',
     'answer22': 'Выберу что-нибудь небольшое мясное', 'answer23': 'Поем ягодный смузи',
     'answer24': 'Возьму стейк', 'animal1': 'Альпака', 'animal2': 'Сова',
     'animal3': 'Манул', 'animal4': 'Медведь'},
    {'question3': '<b>3/9</b> Если бы ты строил для себя загородный дом, каким бы он был?', 'answer31': 'Одноэтажный дом',
     'answer32': 'Высокий дом в лесу', 'answer33': 'Землянка',
     'answer34': 'Комфортный небольшой домик в лесу', 'animal1': 'Альпака', 'animal2': 'Сова',
     'animal3': 'Манул', 'animal4': 'Медведь'},
    {'question4': '<b>4/9</b> Что из этого описывает тебя больше всего?', 'answer41': 'Аккуратный',
     'answer42': 'Чуткий', 'answer43': 'Сильный',
     'answer44': 'Ловкий', 'animal1': 'Альпака', 'animal2': 'Сова',
     'animal3': 'Манул', 'animal4': 'Медведь'},
    {'question5': '<b>5/9</b> Какая твоя любимая погода?', 'answer51': 'Солнце',
     'answer52': 'Пасмурно', 'answer53': 'Снег',
     'answer54': 'Дождь', 'animal1': 'Альпака', 'animal2': 'Сова',
     'animal3': 'Манул', 'animal4': 'Медведь'},
    {'question6': '<b>6/9</b> Какая машина тебе подойдет?', 'answer61': 'Легковая',
     'answer62': 'Джип', 'answer63': 'Газель',
     'answer64': 'Автобус', 'animal1': 'Альпака', 'animal2': 'Сова',
     'animal3': 'Манул', 'animal4': 'Медведь'},
    {'question7': '<b>7/9</b> Какие параметры животных тебе нравятся больше?', 'answer71': 'Доброта и аккуратность',
     'answer72': 'Чуткое зрение и слух', 'answer73': 'Ловкость и незаметность',
     'answer74': 'Сила и спокойствие', 'animal1': 'Альпака', 'animal2': 'Сова',
     'animal3': 'Манул', 'animal4': 'Медведь'},
    {'question8': '<b>8/9</b> Насколько сильно ты любишь покушать?', 'answer81': 'Могу кушать целый день',
     'answer82': 'Ем ночью', 'answer83': 'Кушаю по возможности',
     'answer84': 'Ем редко но очень много', 'animal1': 'Альпака', 'animal2': 'Сова',
     'animal3': 'Манул', 'animal4': 'Медведь'},
    {'question9': '<b>9/9</b> Что тебе ближе?', 'answer91': 'Равнины',
     'answer92': 'Степи', 'answer93': 'Горы',
     'answer94': 'Лес', 'animal1': 'Альпака', 'animal2': 'Сова',
     'animal3': 'Манул', 'animal4': 'Медведь'},
]

#Животные
animals = {
    'Манул': 0,
    'Сова': 0,
    'Медведь': 0,
    'Альпака': 0,
}
final_animals = {}
animals2 = {}